---
kind: other
id: Methods.T:Autodesk.Revit.DB.PropertySetElement
source: html/22acab0f-8806-02e0-6154-fb93763d4a21.htm
---
# PropertySetElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.